Revit 2027 API
BuiltInFailures.CutterFailures.MakeCutterForPlanRegionsGStepFailed Property
 Failed to make cutter for plan view with plan regions. Try deleting one or more plan regions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MakeCutterForPlanRegionsGStepFailed { get; }
Public Shared ReadOnly Property MakeCutterForPlanRegionsGStepFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MakeCutterForPlanRegionsGStepFailed {
	FailureDefinitionId^ get ();
}
static member MakeCutterForPlanRegionsGStepFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CutterFailures Class
Autodesk.Revit.DB Namespace